[
  {
    "id": 1,
    "sender": "Sophie Martin",
    "subject": "Suivi de ma commande #3928",
    "content": "Bonjour, pourriez-vous me dire où se trouve ma commande ? Je l'ai passée il y a 5 jours et je n'ai toujours rien reçu.",
    "timestamp": "2025-03-21T20:54:30.800Z",
    "type": "localisation_colis"
  },
  {
    "id": 2,
    "sender": "Jennifer Leroy",
    "subject": "Annulation de commande",
    "content": "Bonjour, j'aimerais annuler ma commande passée récemment. Malheureusement, j'ai changé d'avis et je préfère obtenir un remboursement. Merci de bien vouloir me confirmer la prise en compte de ma demande.",
    "timestamp": "2025-03-21T20:54:33.240Z",
    "type": "remboursement"
  },
  {
    "id": 3,
    "sender": "Jean Dupont",
    "subject": "Site web qui ne fonctionne pas",
    "content": "Bonjour,\n\nJe rencontre des difficultés à accéder à votre site web depuis ce matin. Lorsque j'essaie de me connecter, la page ne se charge pas correctement et je reçois un message d'erreur. Pouvez-vous m'aider à résoudre ce problème rapidement ? Merci d'avance pour votre assistance.",
    "timestamp": "2025-03-21T20:56:43.882Z",
    "type": "support_technique"
  },
  {
    "id": 6,
    "sender": "Thomas Moreau",
    "subject": "Site web qui ne fonctionne pas",
    "content": "Bonjour, je rencontre des problèmes avec votre site web, il ne se charge pas du tout lorsque j'essaie d'y accéder. J'ai essayé de rafraîchir la page plusieurs fois mais cela ne fonctionne toujours pas. Pouvez-vous m'aider à résoudre ce problème au plus vite ? Merci d'avance pour votre assistance.",
    "timestamp": "2025-03-21T21:00:54.690Z",
    "type": "support_technique"
  },
  {
    "id": 7,
    "sender": "Jennifer Leroy",
    "subject": "Annulation de commande",
    "content": "Bonjour,\n\nJe souhaite annuler ma commande passée récemment et demander un remboursement. Merci de bien vouloir me confirmer la prise en compte de ma demande et me donner les détails concernant la procédure de remboursement.\n\nCordialement.",
    "timestamp": "2025-03-21T21:01:27.177Z",
    "type": "remboursement"
  },
  {
    "id": 8,
    "sender": "Michel Bernard",
    "subject": "Retour produit",
    "content": "Bonjour,\n\nJ'ai récemment acheté un produit sur votre site, mais malheureusement je me suis trompé de taille. J'aimerais donc le retourner pour obtenir un remboursement. Pouvez-vous me guider sur la procédure à suivre pour renvoyer le produit?\n\nMerci d'avance pour votre aide.",
    "timestamp": "2025-03-21T21:01:29.949Z",
    "type": "remboursement"
  }
]